costinm/dmesh/fw/recovery-rust/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
# Rust/ESP-IDF startup and the bounded object worker share the app task. The
# default 8192-byte stack can underflow during the Recovery handoff on C6.
# Recovery starts the shared UART/raw-bearer runtime and flash worker. Keep
# this task at 64 KiB; stream state and manifest storage are heap-owned.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=65536
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE=y
CONFIG_LOG_DEFAULT_LEVEL_WARN=y
CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y
# This ESP32 target caps static RX buffers at 25. It cannot equal the
# 32-packet BA window, but 25 is valid and meets ESP-IDF's requirement that
# the BA window not exceed twice the static buffer count. Dynamic buffers
# supply the remaining bounded headroom; do not use 32 here because Kconfig
# silently discards it and leaves the old value active.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=25
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_ESP_WIFI_RX_BA_WIN=32
CONFIG_ESP_WIFI_TX_BA_WIN=32
# Recovery's STA-only update path must be able to join WPA3-Personal lab and
# infrastructure APs as well as WPA2.  SAE-H2E preserves interoperability
# with APs that require the newer password-element derivation.
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=y
CONFIG_ESP_WIFI_ENABLE_SAE_H2E=y
